export const posts = [
    {
      id: "1",
      title: "Первый пост",
      content: "Содержимое первого поста.",
      author: "Иван",
      date: "2024-07-20",
    },
    {
      id: "2",
      title: "Второй пост",
      content: "Содержимое второго поста.",
      author: "Мария",
      date: "2024-07-21",
    },
    {
      id: "3",
      title: "Второй пост",
      content: "Содержимое третьего поста.",
      author: "Саша",
      date: "2024-05-21",
    },
    {
      id: "4",
      title: "Второй пост",
      content: "Содержимое четвертого поста.",
      author: "Даша",
      date: "2024-02-13",
    },
    {
      id: "5",
      title: "Второй пост",
      content: "Содержимое пятого поста.",
      author: "Костя",
      date: "2022-07-21",
    },
  ];