export const posts = [
  {
    id: "1",
    title: "Просто пост.",
    content: "Содержимое поста.",
    author: "Иван",
    date: "2024-07-20",
    comments: [
      {
        id: "1.1",
        content: "Первый комментарий. Вау!",
        author: "Саша",
        date: "2025-01-20",
      },
      {
        id: "1.2",
        content: "А это уже второй комментарий.",
        author: "Даша",
        date: "2025-02-10",
      },
      {
        id: "1.3",
        content: "Ничего себе, третий комментарий.",
        author: "Катя",
        date: "2025-03-15",
      },
    ],
  },
  {
    id: "2",
    title: "Пост с саааамым длинным заголовком.",
    content: "Содержимое поста.",
    author: "Мария",
    date: "2024-07-21",
    comments: [
      {
        id: "2.1",
        content: "Первый комментарий. Вау!",
        author: "Саша",
        date: "2025-01-20",
      },
      {
        id: "2.2",
        content: "А это уже второй комментарий.",
        author: "Даша",
        date: "2025-02-10",
      },
      {
        id: "2.3",
        content: "Ничего себе, третий комментарий.",
        author: "Катя",
        date: "2025-03-15",
      },
    ],
  },
  {
    id: "3",
    title: "Пост ни о чем",
    content: "Содержимое поста.",
    author: "Саша",
    date: "2024-05-21",
    comments: [
      {
        id: "3.1",
        content: "Первый комментарий. Вау!",
        author: "Саша",
        date: "2025-01-20",
      },
      {
        id: "3.2",
        content: "А это уже второй комментарий.",
        author: "Даша",
        date: "2025-02-10",
      },
      {
        id: "3.3",
        content: "Ничего себе, третий комментарий.",
        author: "Катя",
        date: "2025-03-15",
      },
    ],
  },
  {
    id: "4",
    title: "Пост о смысле жизни",
    content: "Смысла нет, мы создаем его сами.",
    author: "Даша",
    date: "2024-02-13",
    comments: [
      {
        id: "4.1",
        content: "Первый комментарий. Вау!",
        author: "Саша",
        date: "2025-01-20",
      },
      {
        id: "4.2",
        content: "А это уже второй комментарий.",
        author: "Даша",
        date: "2025-02-10",
      },
      {
        id: "4.3",
        content: "Ничего себе, третий комментарий.",
        author: "Катя",
        date: "2025-03-15",
      },
    ],
  },
  {
    id: "5",
    title: "Еще один пост",
    content: "Содержимое еще одного поста.",
    author: "Костя",
    date: "2022-07-21",
    comments: [
      {
        id: "5.1",
        content: "Первый комментарий. Вау!",
        author: "Саша",
        date: "2025-01-20",
      },
      {
        id: "5.2",
        content: "А это уже второй комментарий.",
        author: "Даша",
        date: "2025-02-10",
      },
      {
        id: "5.3",
        content: "Ничего себе, третий комментарий.",
        author: "Катя",
        date: "2025-03-15",
      },
    ],
  },
];
